
import styled from "styled-components";
export const SecImage = styled.div`
min-height: 100vh;
display: flex;
align-items: center;
justify-content: center;
flex-flow: column;
position: relative;
z-index: 0;
`
export const Image = styled.img`
    position: absolute;
    top: 0;
    left: 0;
    z-index: -1;
    height: 100%;
    width: 100%;
    object-fit: cover;

`
export const Media = styled.h3`
    color: white;
    font-size: 30px;
    position: absolute;
    top: 100px;
    text-align:center;
    position: absolute;
    left: 50%;
    transform: translateX(-50%);
    &::before{
        content: "\f358";
        font-weight: 900;
        font-family: "Font Awesome 6 Free";
        position: absolute;
        top: 60px;
        left: 50%;
        transform: translateX(-50%);
        animation: up-bouncing 1.5s linear infinite;
    }

@keyframes up-bouncing{
    0%,10%,20%,50%,70%,90%{
        transform: translateY(0)
    }
    40%,80%,100%{
       transform: translateY(-30%)
    }

   }
`

export const Head = styled.h3`
-webkit-text-fill-color: rgb(250, 250, 250);
-webkit-text-stroke: 1px rgba(3, 36, 47, 0.769);
width: 70%;

&::after {
    content: "|";
    -webkit-animation: typing 20s infinite;
}
@media(max-width:578px){
    width: 100%; 
    position:relative;
    top:50px;
    text-align: center;
}
@keyframes typing {
    0% {
        content: "|";
    }

    5% {
        content: "ي|";
    }

    1 {
        content: "يع'|";
    }

    1.5% {
        content: "يعل|";
    }

    2% {
        content: "يعلن |";
    }

    2.5% {
        content: "يعلن م";
    }

    3% {
        content: "يعلن مر|";
    }

    3.5% {
        content: "يعلن مرك|";
    }

    4% {
        content: "يعلن مركز|";
    }

    4.5% {
        content: "يعلن مركز |";
    }

    5% {
        content: "يعلن مركز ا|";
    }

    5.5% {
        content: "يعلن مركز ال|";
    }

    6% {
        content: "يعلن مركز الك|";
    }

    6.5% {
        content: "يعلن مركز الكب|";
    }

    7% {
        content: "يعلن مركز الكبد|";
    }

    7.5% {
        content: "يعلن مركز الكبد |";
    }

    8% {
        content: "يعلن مركز الكبد و|";
    }

    8.5% {
        content: "يعلن مركز الكبد وا|";
    }

    9% {
        content: "يعلن مركز الكبد وال|";
    }

    9.5% {
        content: "يعلن مركز الكبد والج|";
    }

    10% {
        content: "يعلن مركز الكبد والجه|";
    }

    10.5% {
        content: "يعلن مركز الكبد والجها|";
    }

    11% {
        content: "يعلن مركز الكبد والجهاز|";
    }

    11.5% {
        content: "يعلن مركز الكبد والجهاز |";
    }

    12% {
        content: "يعلن مركز الكبد والجهاز ا|";
    }

    12.5% {
        content: "يعلن مركز الكبد والجهاز ال|";
    }

    13% {
        content: "يعلن مركز الكبد والجهاز اله|";
    }

    13.5% {
        content: "يعلن مركز الكبد والجهاز الهض|";
    }

    14% {
        content: "يعلن مركز الكبد والجهاز الهضم|";
    }

    14.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى|";
    }

    15% {
        content: "يعلن مركز الكبد والجهاز الهضمى |";
    }

    15.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى ع|";
    }

    16% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن|";
    }

    16.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن |";
    }

    17% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن ح|";
    }

    17.5% {
        content: " يعلن مركز الكبد والجهاز الهضمى عن حض|";
    }

    18% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضو|";
    }

    18.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور|";
    }

    19% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور |";
    }

    19.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور ا|";
    }

    20% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور ال|";
    }

    20.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الد|";
    }

    21% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدك|";
    }

    21.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكت|";
    }

    22% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتو|";
    }

    22.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور|";
    }

    23% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور |";
    }

    23.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور ع|";
    }

    24% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عم|";
    }

    24.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمر|";
    }

    25% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو|";
    }

    25.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى  عن حضور الدكتور عمرو |";
    }

    26% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو م|";
    }

    26.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو مح|";
    }

    27% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محف|";
    }

    27.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفو|";
    }

    28% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ|";
    }

    28.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ |";
    }

    29% {
        content: " يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أ|";
    }

    29.5% {
        content: " يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخ|";
    }

    30% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخص|";
    }

    30.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصا|";
    }

    31% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائ|";
    }

    31.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى|";
    }

    32% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى |";
    }

    32.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى ا|";
    }

    33% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى ال|";
    }

    33.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى الع|";
    }
    34% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظ|";
    }
    34.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظا|";
    }
    35% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام|";
    }
    35.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام |";
    }
    36% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام و|";
    }
    36.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وه|";
    }
    37% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهش|";
    }
    37.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشا |";
    }
    38% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاش |";
    }
    38.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة |";
    }
    39% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة  |";
    }
    39.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة ا |";
    }
    40% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة ال|";
    }
    40.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة الع  |";
    }
    41% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظ |";
    }
    41.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام |";
    }
    42 {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام  |";
    }
    42.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام ي  |";
    }
    43% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يو |";
    }
    43.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم |";
    }
    44% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم ا |";
    }
    44.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم ال |";
    }
    45% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الث|";
    }
    45.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلا|";
    }
    46.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاث|";
    }
    46.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثا|";
    }
    47% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء|";
    }
    47.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء  |";
    }
    48% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء ا|";
    }
    48.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء ال|";
    }
    49% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء الق|";
    }
    49.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القا|";
    }
    50% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القاد|";
    }
    50.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم|";
    }
    51% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم |";
    }
    51.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم |";
    }
    52% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم م|";
    }
    52.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من|";
    }
    53% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من |";
    }
    53.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من ا|";
    }
    54% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من ال|";
    }
    54.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الس|";
    }
    55% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من السا|";
    }
    55.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة|";
    }
    56% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة |";
    }
    56.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة ا|";
    }
    57% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة ال|";
    }
    57.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخ |";
    }
    58% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخا|";
    }
    58.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخام|";
    }
    59% {
        content: " يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامس|";
    }
    59.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة |";
    }
    60% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة ا|";
    }
    60.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة ال |";
    }
    61.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى|";
    }
    62% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى ا|";
    }
    62.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى ال|";
    }
    63% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة ال  الس|";
    }
    63.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى السا|";
    }
    64% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساع|";
    }
    64.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة|";
    }
    65% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة|";
    }
    65.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة |";
    }
    66% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة ا|";
    }
    66.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة ال|";
    }
    67% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الث|";
    }
    67.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثا|";
    }
    68% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثام|";
    }
    68.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثامن|";
    }
    69% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثامنة|";
    }
    69.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثامنة |";
    }
    70% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثامنة م|";
    }
    70.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثامنة مس|";
    }
    71% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثامنة مسا|";
    }
    71.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثامنة مساء|";
    }
    72% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثامنة مساء |";
    }
    72.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثامنة مسا|";
    }
    73% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثامنة م|";
    }
    73.5% {
        content: " يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثامنة|";
    }
    74% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الثام|";
    }
    74.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة الث|";
    }
    75% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى الساعة ا|";
    }
    75.5% {
        content: " يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى السا|";
    }
    76% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى ال|";
    }
    76.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة الى|";
    }
    77% {
        content: " يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخامسة|";
    }
    77.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من الساعة الخام|";
    }
    78% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من ال|";
    }
    78.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم من|";
    }
    79% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القادم|";
    }
    79.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء القا|";
    }
    80% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء ال|";
    }
    80.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاثاء|";
    }
    81% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثلاث|";
    }
    81.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم الثل|";
    }
    82% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم ال|";
    }
    82.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام يوم|";
    }
    83% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام ي|";
    }
    83.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة العظام|";
    }
    84% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة الع|";
    }
    84.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وهشاشة|";
    }
    85% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام وه|";
    }
    85.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظام|";
    }
    86% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى العظا|";
    }
    86.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى الع|";
    }
    87% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى ا|";
    }
    87.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصائى|";
    }
    88% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخصا|";
    }
    88.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ أخ|";
    }
    89% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو محفوظ |";
    }
    89.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو م|";
    }
    90% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عمرو|";
    }
    90.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور عم|";
    }
    91% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتور |";
    }
    91.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدكتو|";
    }
    92% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور الدك|";
    }
    92.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور ال|";
    }
    93% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حضور|";
    }
    93.5% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن حض|";
    }
    94% {
        content: "يعلن مركز الكبد والجهاز الهضمى عن |";
    }
    94.5% {
        content: "يعلن مركز الكبد والجهاز الهضم|";
    }
    95% {
        content: "يعلن مركز الكبد والجهاز الهض |";
    } 
    96% {
        content: "يعلن مركز الكبد والجهاز ال|";
    }
    96.5% {
        content: "يعلن مركز الكبد والجهاز |";
    }
    97% {
        content: "يعلن مركز الكبد والجه|";
    }
    97.5% {
        content: "يعلن مركز الكبد وال|";
    }
    98% {
        content: "يعلن مركز الكبد و|";
    }
    98.5% {
        content: "يعلن مركز الكبد|";
    }
    99% {
        content: "يعلن مركز الك|";
    }
    99.5% {
        content: "يعلن |";
    }
    100% {
        content: "|";
    }


}
`
export const Content = styled.div`
background-color: rgba(3,36,47,0.594);
    width: 150px;
    height: 30px;
    position: absolute;
    bottom: 20px;
    border-radius: 40px;
    position: absolute;
    left: 50%;
    transform: translateX(-50%);

`
export const Span =styled.span`
cursor: pointer;
    background: rgba(255,255,255,0.668);
    width: 20px;
    height: 5px;
    position: absolute;
    bottom: 20px;
    z-index: 10;
    left: 40%;
    top: 50%;
    transform: translateY(-50%);
   
z-index:10;
    margin-left:${props => props.first === "1" ?"-40px":''};
    margin-left:${props => props.first === "2" ?"-10px":''};
    margin-left:${props => props.first === "3" ?"20px":''};
    margin-left:${props => props.first === "4" ?"50px":''};

`